{
  "architectures": [
    "DPTForDepthEstimation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_loss_weight": 0.4,
  "backbone_out_indices": [
    5,
    11,
    17,
    23
  ],
  "fusion_hidden_size": 256,
  "head_in_index": -1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "image_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-12,
  "model_type": "dpt",
  "neck_hidden_sizes": [
    256,
    512,
    1024,
    1024
  ],
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "patch_size": 16,
  "qkv_bias": true,
  "readout_type": "project",
  "reassemble_factors": [
    4,
    2,
    1,
    0.5
  ],
  "semantic_classifier_dropout": 0.1,
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.18.0.dev0",
  "use_auxiliary_head": true,
  "use_batch_norm_in_fusion_residual": false
}
